<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>IKEv2</key>
            <dict>
              <key>OnDemandEnabled</key>
                <integer>1</integer>
              <key>OnDemandRules</key>
              <array>
                  <dict>
                    <key>Action</key>
                      <string>Connect</string>
                      <key>InterfaceTypeMatch</key>
                      <string>WiFi</string>
                    <key>URLStringProbe</key>
                      <string>http://captive.apple.com/hotspot-detect.html</string>
                  </dict>
                  <dict>
                    <key>Action</key>
                      <string>Connect</string>
                      <key>InterfaceTypeMatch</key>
                      <string>Cellular</string>
                    <key>URLStringProbe</key>
                      <string>http://captive.apple.com/hotspot-detect.html</string>
                  </dict>
                  <dict>
                    <key>Action</key>
                      <string>Disconnect</string>
                  </dict>
                </array>
                <key>AuthenticationMethod</key>
                <string>Certificate</string>
                <key>ChildSecurityAssociationParameters</key>
                <dict>
                    <key>DiffieHellmanGroup</key>
                    <integer>20</integer>
                    <key>EncryptionAlgorithm</key>
                    <string>AES-256-GCM</string>
                    <key>IntegrityAlgorithm</key>
                    <string>SHA2-512</string>
                    <key>LifeTimeInMinutes</key>
                    <integer>20</integer>
                </dict>
                <key>DeadPeerDetectionRate</key>
                <string>Medium</string>
                <key>DisableMOBIKE</key>
                <integer>0</integer>
                <key>DisableRedirect</key>
                <integer>1</integer>
                <key>EnableCertificateRevocationCheck</key>
                <integer>0</integer>
                <key>EnablePFS</key>
                <true/>
                <key>IKESecurityAssociationParameters</key>
                <dict>
                    <key>DiffieHellmanGroup</key>
                    <integer>20</integer>
                    <key>EncryptionAlgorithm</key>
                    <string>AES-256-GCM</string>
                    <key>IntegrityAlgorithm</key>
                    <string>SHA2-512</string>
                    <key>LifeTimeInMinutes</key>
                    <integer>20</integer>
                </dict>
                <key>LocalIdentifier</key>
                <string>vpn</string>
                <key>PayloadCertificateUUID</key>
                <string>6D827E46-F3AD-57DA-9434-BC1A50101412</string>
                <key>CertificateType</key>
                <string>ECDSA384</string>
                <key>ServerCertificateIssuerCommonName</key>
                <string>134.209.42.99</string>
                <key>RemoteAddress</key>
                <string>134.209.42.99</string>
                <key>RemoteIdentifier</key>
                <string>134.209.42.99</string>
                <key>UseConfigurationAttributeInternalIPSubnet</key>
                <integer>0</integer>
            </dict>
            <key>IPv4</key>
            <dict>
                <key>OverridePrimary</key>
                <integer>1</integer>
            </dict>
            <key>PayloadDescription</key>
            <string>Configures VPN settings</string>
            <key>PayloadDisplayName</key>
            <string>stanvpn</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.vpn.managed.4336AD33-6E42-5353-B1AB-5738AFE21F17</string>
            <key>PayloadType</key>
            <string>com.apple.vpn.managed</string>
            <key>PayloadUUID</key>
            <string>4336AD33-6E42-5353-B1AB-5738AFE21F17</string>
            <key>PayloadVersion</key>
            <real>1</real>
            <key>Proxies</key>
            <dict>
                <key>HTTPEnable</key>
                <integer>0</integer>
                <key>HTTPSEnable</key>
                <integer>0</integer>
            </dict>
            <key>UserDefinedName</key>
            <string>AlgoVPN stanvpn IKEv2</string>
            <key>VPNType</key>
            <string>IKEv2</string>
        </dict>
        <dict>
            <key>Password</key>
            <string>EZhi2gRk</string>
            <key>PayloadCertificateFileName</key>
            <string>vpn.p12</string>
            <key>PayloadContent</key>
            <data>
            MIIEdQIBAzCCBDsGCSqGSIb3DQEHAaCCBCwEggQoMIIEJDCCAs8GCSqGSIb3DQEHBqCCAsAwggK8AgEAMIICtQYJKoZIhvcNAQcBMBwGCiqGSIb3DQEMAQYwDgQI2OuQJyHin1cCAggAgIICiApFImaYlED+p41ja9hR6izCTPK3MWpVr6ftzkKwkA/8ES26QQtOilpa1BhOp51taxZ1wAbfPXqjJ9c6G39EgLhXkolb3699I6KGlZ5qS5sHFpAeBqC+DPXGAVV5Pjg6EYJh4zOcz4SlzBF+6l/I1owMnhEAcht8nezvEZud9ioJvAMPl2/6pKO9Rbzv2ZM7Xl9NTR1FLAxZkeNgOKtyluj0yKtGFvzWt42atersUY6oauUYrI8RhzkpUqjSY4WF6mSZgr2jcZHxTvh0Qz6b1GVhDwvLXJuws7ScCdnYA/eic0xy6AijYHs0D9mgCaBgkLkzggNuuJJotXtEprAq94b0uPD4AZuWRqmOqaDoBCobumosXK8NIbZx2BswFEy3Jy+JXMpLnkvHu2m0LRtMgfs3mw6fLUUl6VndY4ZOatlbM7uCogFB3d/o/yi1mlCSUWj417B07i9R5tXQJQxMIrqkaSvAQPd0c8TjX5xRmaW4doqPxxaB3LI/DzrS67fMBKvQ/lnbdvB9+y2o0NvAoYu9FfC69F1Xl2DEJvDLjOyYYqiHDgdIYXwSLF2HrpbcNbkSd1Yadt/njzlfw8AbjDlYL+Xt5dTteeyrAFmLcKLVmCt8tCsYEhgiNVQG+knv9hEPeV1E6KRFpZHkZb+qNyNClWDZ64Dlgr7H9o6QR3ZlJXyz0XPEmOKwYnGO+un9YKlhK5V+dIdrQ2WOBLCmK4toVlz/PLA1vkf+hCmpKHG7zswMVr3pLuNL0rU1x+4zdawuttoDuGnboCwL6LbzEoi3tW0pxJDSP4p7sFq0WNDBK1kLSYxD9UI4BmF0prP/hheHeX/VeR4BK3JJxw5dw/3dXvyX38tM/jCCAU0GCSqGSIb3DQEHAaCCAT4EggE6MIIBNjCCATIGCyqGSIb3DQEMCgECoIHkMIHhMBwGCiqGSIb3DQEMAQMwDgQI04ot7kOV8asCAggABIHA/PpxorHc+UMX26zl1qCce3VT7TRbtf9mxcNPuk5U0yweIEm6U9h/zR0dhIdJbg2iWGTnFHwu8kMu61mTwWmrOaIGh13U0oSNkXT+EJMF2M1uuSX/rWf2Cx0Scvi1SERJybiDglJH8CPDGMu6TyjH8WRSFnITm3OkalXmesyGvScer5UtAx1dDwWLXrzjk2ASWpm0o2SqtgdmlE7zq1YaaQaN2nmwVi9JNADpUApJvNdacER+6QFpqTVzuoU2d3LHMTwwFQYJKoZIhvcNAQkUMQgeBgB2AHAAbjAjBgkqhkiG9w0BCRUxFgQUKH0kg5pnS7ILml/KYbyEBXRc/MMwMTAhMAkGBSsOAwIaBQAEFOfC8BE28T6t6f3Rh7vE4IIBFaSyBAjB23qxN3ZK+wICCAA=
            </data>
            <key>PayloadDescription</key>
            <string>Adds a PKCS#12-formatted certificate</string>
            <key>PayloadDisplayName</key>
            <string>stanvpn</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.security.pkcs12.6D827E46-F3AD-57DA-9434-BC1A50101412</string>
            <key>PayloadType</key>
            <string>com.apple.security.pkcs12</string>
            <key>PayloadUUID</key>
            <string>6D827E46-F3AD-57DA-9434-BC1A50101412</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
        <dict>
            <key>PayloadCertificateFileName</key>
            <string>ca.crt</string>
            <key>PayloadContent</key>
            <data>
            LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUI3RENDQVhLZ0F3SUJBZ0lKQU1OZGxXOGQwVDdTTUFvR0NDcUdTTTQ5QkFNQ01CZ3hGakFVQmdOVkJBTU0KRFRFek5DNHlNRGt1TkRJdU9Ua3dIaGNOTVRrd016RTNNRGt6TmpJMldoY05Namt3TXpFME1Ea3pOakkyV2pBWQpNUll3RkFZRFZRUUREQTB4TXpRdU1qQTVMalF5TGprNU1IWXdFQVlIS29aSXpqMENBUVlGSzRFRUFDSURZZ0FFCjFGUXNnNTNMd1VBN1lLK3FoUnRBd1RPTExmVmpnVzNiR2t6WDc1dXlyYjN0QkNSNERsc2pqcDNEcEpYa1VtZ0oKSHI3R0lyUVdzT0orNlJOU3UzVHpXTSsrNEN0Q0tua2o3ODA2b0pISGFwRW84OE84S1kyaStDRjZiOUtQTm52VwpvNEdITUlHRU1CMEdBMVVkRGdRV0JCUkpNUEs5UHc3VW1BYjhCRSs4UmVwb1JGQ2I3ekJJQmdOVkhTTUVRVEEvCmdCUkpNUEs5UHc3VW1BYjhCRSs4UmVwb1JGQ2I3NkVjcEJvd0dERVdNQlFHQTFVRUF3d05NVE0wTGpJd09TNDAKTWk0NU9ZSUpBTU5kbFc4ZDBUN1NNQXdHQTFVZEV3UUZNQU1CQWY4d0N3WURWUjBQQkFRREFnRUdNQW9HQ0NxRwpTTTQ5QkFNQ0EyZ0FNR1VDTVFEMndEVmc2ZGpscWEyZVNQOUMzUEVNUzBMR0hVa0ZPRjRvSGxPdXJwZU9BVURNCjdKMkN6Q1A3L1BqWW02WmVTRXdDTUFNR2wrSW5LOU9hcVdNOVdlbGJJcDh4Y3k5OGxqZ3dGOWxFcnB6dm5LdWgKaW43VTBjbnlHL1FuclNHRDBQZG1hUT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0=
            </data>
            <key>PayloadDescription</key>
            <string>Adds a CA root certificate</string>
            <key>PayloadDisplayName</key>
            <string>stanvpn</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.security.root.412E9ADD-B52E-54F0-A02B-2DA6305EF9CE</string>
            <key>PayloadType</key>
            <string>com.apple.security.root</string>
            <key>PayloadUUID</key>
            <string>412E9ADD-B52E-54F0-A02B-2DA6305EF9CE</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
    </array>
    <key>PayloadDisplayName</key>
    <string>AlgoVPN stanvpn IKEv2</string>
    <key>PayloadIdentifier</key>
    <string>donut.local.A6077650-50F0-5389-B7AC-5000D1CDD573</string>
    <key>PayloadOrganization</key>
	<string>AlgoVPN</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>25BDAC8C-7D0A-5530-ACAC-EC37C7F901AE</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
</dict>
</plist>
